In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

# データの形が異なる計算

In [2]:
ser1 = Series([0,1,2],index=['A','B','C'])
ser2 =Series([3,4,5,6],index=['A','B','C','D'])

In [3]:
ser1+ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [5]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'),index=['Tokyo','Kyoto'])
dframe2 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ABC'),index=['Tokyo','Kyoto','Chiba'])

In [10]:
dframe1

       A  B
Tokyo  0  1
Kyoto  2  3

In [11]:
dframe2

       A  B  C
Tokyo  0  1  2
Kyoto  3  4  5
Chiba  6  7  8

In [9]:
dframe1 + dframe2

         A    B   C
Chiba  NaN  NaN NaN
Kyoto  5.0  7.0 NaN
Tokyo  0.0  2.0 NaN

In [12]:
dframe1.add(dframe2,fill_value=0)

         A    B    C
Chiba  6.0  7.0  8.0
Kyoto  5.0  7.0  5.0
Tokyo  0.0  2.0  2.0

In [13]:
dframe2.add(dframe1,fill_value=0)

         A    B    C
Chiba  6.0  7.0  8.0
Kyoto  5.0  7.0  5.0
Tokyo  0.0  2.0  2.0

In [16]:
ser2 = dframe2.iloc[0:2]

In [17]:
ser2

       A  B  C
Tokyo  0  1  2
Kyoto  3  4  5